ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28003x_bgcrc_regs.xml
<module id="BGCRC_REGS" HW_revision="" description="BGCRC Registers">
	<register id="BGCRC_EN" width="32" page="1" offset="0x0" internal="0" description="BGCRC Enable">
		<bitfield id="START" description="Start Bit used to  Kick-off CRC calculations" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="RUN_STS" description="CRC module activity monitor" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="BGCRC_CTRL1" width="32" page="1" offset="0x2" internal="0" description="BGCRC Control register 1">
		<bitfield id="FREE_SOFT" description="emulation control bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="NMIDIS" description="NMI disable configuration" begin="19" end="16" width="4" rwaccess="RW"/>
	</register>
	<register id="BGCRC_CTRL2" width="32" page="1" offset="0x4" internal="0" description="BGCRC Control register 2">
		<bitfield id="BLOCK_SIZE" description="block size for memory check" begin="9" end="0" width="10" rwaccess="RW"/>
		<bitfield id="TEST_HALT" description="TEST_HALT configuration" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="SCRUB_MODE" description="Scrub mode configuration" begin="19" end="16" width="4" rwaccess="RW"/>
	</register>
	<register id="BGCRC_START_ADDR" width="32" page="1" offset="0x6" internal="0" description="Start address for the BGCRC check">
		<bitfield id="START_ADDRESS" description="Start address" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BGCRC_SEED" width="32" page="1" offset="0x8" internal="0" description="Seed for CRC calculation">
		<bitfield id="SEED" description="Initial CRC value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BGCRC_GOLDEN" width="32" page="1" offset="0xe" internal="0" description="Golden CRC to be compared against">
		<bitfield id="CRC_VALUE" description="Expected CRC value" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BGCRC_RESULT" width="32" page="1" offset="0x10" internal="0" description="CRC calculated">
		<bitfield id="CRC_VALUE" description="CRC result register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BGCRC_CURR_ADDR" width="32" page="1" offset="0x12" internal="0" description="Current address regsiter">
		<bitfield id="CURRENT_ADDR" description="Current address  from where the data is fetched." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BGCRC_WD_CFG" width="32" page="1" offset="0x1c" internal="0" description="BGCRC windowed watchdog configuration">
		<bitfield id="WDDIS" description="CRC Watchdog disable" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="BGCRC_WD_MIN" width="32" page="1" offset="0x1e" internal="0" description="BGCRC windowed watchdog min value">
		<bitfield id="MINVAL" description="Minimum value configuration for CRC windowed watchdog" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BGCRC_WD_MAX" width="32" page="1" offset="0x20" internal="0" description="BGCRC windowed watchdog max value">
		<bitfield id="MAXVAL" description="Maximum value configuration for CRC windowed watchdog" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="BGCRC_WD_CNT" width="32" page="1" offset="0x22" internal="0" description="BGCRC windowed watchdog count">
		<bitfield id="WD_CNT" description="CRC windowed watchdog counter value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BGCRC_NMIFLG" width="32" page="1" offset="0x2a" internal="0" description="BGCRC NMI flag register">
		<bitfield id="CRC_FAIL" description="CRC computation failed" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="UNCORRECTABLE_ERR" description="Uncorrectable error obtained during memory data read." begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CORRECTABLE_ERR" description="Correctable ECC error obtained during memory data read." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="WD_UNDERFLOW" description="CRC/scrubbing completed before BGCRC_WD_MIN" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="WD_OVERFLOW" description="CRC/scrubbing did not complete within BGCRC_WD_MAX" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
	<register id="BGCRC_NMICLR" width="32" page="1" offset="0x2c" internal="0" description="BGCRC NMI flag clear register">
		<bitfield id="CRC_FAIL" description="CRC_FAIL NMI flag clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="UNCORRECTABLE_ERR" description="UNCORRECTABLE_ERR NMI flag clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR NMI flag clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WD_UNDERFLOW" description="WD_UNDERFLOW NMI flag clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="WD_OVERFLOW" description="WD_OVERFLOW NMI flag clear" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="BGCRC_NMIFRC" width="32" page="1" offset="0x2e" internal="0" description="BGCRC NMI flag force register">
		<bitfield id="CRC_FAIL" description="CRC_FAIL NMI force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="UNCORRECTABLE_ERR" description="UNCORRECTABLE_ERR NMI force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR NMI force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WD_UNDERFLOW" description="WD_UNDERFLOW NMI force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="WD_OVERFLOW" description="WD_OVERFLOW NMI force" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="BGCRC_INTEN" width="32" page="1" offset="0x34" internal="0" description="Interrupt enable">
		<bitfield id="TEST_DONE" description="TEST_DONE interrupt enable register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CRC_FAIL" description="CRC_FAIL interrupt enable register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="UNCORRECTABLE_ERR" description="UNCORRECTABLE_ERR interrupt enable register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR interrupt enable register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WD_UNDERFLOW" description="WD_UNDERFLOW interrupt enable register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="WD_OVERFLOW" description="WD_OVERFLOW interrupt enable register" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="BGCRC_INTFLG" width="32" page="1" offset="0x36" internal="0" description="Interrupt flag">
		<bitfield id="INT" description="Global Interrupt status flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="TEST_DONE" description="TEST_DONE Interrupt status flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CRC_FAIL" description="CRC computation failed" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="UNCORRECTABLE_ERR" description="Uncorrectable error obtained during memory data read." begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CORRECTABLE_ERR" description="Correctable ECC error obtained during memory data read." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="WD_UNDERFLOW" description="CRC/scrubbing completed before BGCRC_WD_MIN" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="WD_OVERFLOW" description="CRC/scrubbing did not complete within BGCRC_WD_MAX" begin="6" end="6" width="1" rwaccess="R"/>
	</register>
	<register id="BGCRC_INTCLR" width="32" page="1" offset="0x38" internal="0" description="Interrupt flag clear">
		<bitfield id="INT" description="Global Interrupt clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TEST_DONE" description="TEST_DONE Interrupt clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CRC_FAIL" description="CRC_FAIL interrupt clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="UNCORRECTABLE_ERR" description="UNCORRECTABLE_ERR interrupt clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR interrupt clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WD_UNDERFLOW" description="WD_UNDERFLOW interrupt clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="WD_OVERFLOW" description="WD_OVERFLOW interrupt clear" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="BGCRC_INTFRC" width="32" page="1" offset="0x3a" internal="0" description="Interrupt flag force">
		<bitfield id="TEST_DONE" description="TEST_DONE Interrupt force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CRC_FAIL" description="CRC_FAIL interrupt force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="UNCORRECTABLE_ERR" description="UNCORRECTABLE_ERR interrupt force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR interrupt force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WD_UNDERFLOW" description="WD_UNDERFLOW interrupt force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="WD_OVERFLOW" description="WD_OVERFLOW interrupt force" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="BGCRC_LOCK" width="32" page="1" offset="0x3c" internal="0" description="BGCRC register map lockconfiguration">
		<bitfield id="BGCRC_EN" description="Register lock configuration" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_CTRL1" description="Register lock configuration" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_CTRL2" description="Register lock configuration" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_START_ADDR" description="Register lock configuration" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_SEED" description="Register lock configuration" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_GOLDEN" description="Register lock configuration" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_WD_CFG" description="Register lock configuration" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_WD_MIN" description="Register lock configuration" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_WD_MAX" description="Register lock configuration" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_NMIFRC" description="Register lock configuration" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_INTEN" description="Register lock configuration" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_INTFRC" description="Register lock configuration" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
	<register id="BGCRC_COMMIT" width="32" page="1" offset="0x3e" internal="0" description="BGCRC register map commit configuration">
		<bitfield id="BGCRC_EN" description="Register lock committed" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_CTRL1" description="Register lock committed" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_CTRL2" description="Register lock committed" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_START_ADDR" description="Register lock committed" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_SEED" description="Register lock committed" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_GOLDEN" description="Register lock committed" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_WD_CFG" description="Register lock committed" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_WD_MIN" description="Register lock committed" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_WD_MAX" description="Register lock committed" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_NMIFRC" description="Register lock committed" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_INTEN" description="Register lock committed" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="BGCRC_INTFRC" description="Register lock committed" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
</module>
